app/controllers/main_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`name` = BINARY 'למינג בדרכים') LIMIT 1
UPDATE `users` SET `updated_at` = '2009-09-15 12:23:30', `participates` = 0 WHERE `id` = 7
---
	def set_view_type
		@users = User.find(:all, :order => "name")
    session[:view_type] = params[:view_type]
    temp_user = User.find_by_name(session[:name])
    if params[:view_type] != nil and temp_user != nil
      temp_user.view_type = params[:view_type]
      temp_user.save

INSERT INTO `users` (`name`, `salt`, `participates`, `created_at`, `updated_at`, `password_hash`) VALUES('מפלץ', '-6171577880.0760422398110013', NULL, '2009-09-14 13:13:25', '2009-09-14 13:13:25', '43cab4f2b53a3838f6cca93d9de7133554f8d025')
---
	def add_user
		@user = User.new(params[:user])
		 if @user.save